# Filter

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'gruplar':['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,111,969]},
                 columns=['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [3]:
def filter_func(x):
    return x['degisken1'].std() > 9

In [4]:
df.groupby('gruplar').std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [5]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [6]:
def filter_func2(x):
    return x['degisken1'].mean() > 15

df.groupby('gruplar').filter(filter_func2)

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [7]:
def filter_func3(x):
    return x['degisken1'].sum() > 100
df.groupby('gruplar').filter(filter_func3)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [8]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                 index=['mouse', 'rabbit'],
                 columns=['one', 'two', 'three'])
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [9]:
df.filter(items=['one', 'two'])

        one  two
mouse     1    2
rabbit    4    5

In [10]:
df.filter(items=['mouse'], axis=0)

       one  two  three
mouse    1    2      3

In [11]:
df.filter(regex='e$', axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [12]:
df.filter(regex='o$', axis=1)

        two
mouse     2
rabbit    5

In [13]:
df.filter(regex='$t', axis=1)

Empty DataFrame
Columns: []
Index: [mouse, rabbit]

In [14]:
df.filter(like='bbi', axis=0)

        one  two  three
rabbit    4    5      6

In [15]:
df.filter(like='ou', axis=0)

       one  two  three
mouse    1    2      3

In [16]:
df.filter(like='ne', axis=1)

        one
mouse     1
rabbit    4

In [17]:
df.filter(like='w', axis=1)

        two
mouse     2
rabbit    5

In [18]:
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [19]:
df.filter(items=['mouse'], axis=0)

       one  two  three
mouse    1    2      3

In [20]:
df.filter(items=['one'], axis=1)

        one
mouse     1
rabbit    4

In [21]:
df = pd.DataFrame({'kolon1':[1,2,3], 'kolon2':[4,5,6]}, index=['index1', 'index2', 'index3'])
df

        kolon1  kolon2
index1       1       4
index2       2       5
index3       3       6

In [22]:
df.filter(items=['kolon1'])

        kolon1
index1       1
index2       2
index3       3

In [23]:
df.filter(items=['kolon2'], axis=1)

        kolon2
index1       4
index2       5
index3       6

In [24]:
df.filter(items=['index2'], axis=0)

        kolon1  kolon2
index2       2       5

In [25]:
df.filter(like='5')

Empty DataFrame
Columns: []
Index: [index1, index2, index3]

In [26]:
df.iloc[1,1]

5

In [27]:
type(df.iloc[1,1])

numpy.int64

In [28]:
df

        kolon1  kolon2
index1       1       4
index2       2       5
index3       3       6

In [29]:
df.filter(regex='o$')

Empty DataFrame
Columns: []
Index: [index1, index2, index3]

In [30]:
df.filter(regex='$x3', axis=1)

Empty DataFrame
Columns: []
Index: [index1, index2, index3]

In [31]:
?df.transform

Signature: df.transform(func: 'AggFuncType', axis: 'Axis' = 0, *args, **kwargs) -> 'DataFrame'
Docstring:
Call ``func`` on self producing a DataFrame with the same axis shape as self.

Parameters
----------
func : function, str, list-like or dict-like
    Function to use for transforming the data. If a function, must either
    work when passed a DataFrame or when passed to DataFrame.apply. If func
    is both list-like and dict-like, dict-like behavior takes precedence.

    Accepted combinations are:

    - function
    - string function name
    - list-like of functions and/or function names, e.g. ``[np.exp, 'sqrt']``
    - dict-like of axis labels -> functions, function names or list-like of such.
axis : {0 or 'index', 1 or 'columns'}, default 0
        If 0 or 'index': apply function to each column.
        If 1 or 'columns': apply function to each row.
*args
    Positional arguments to pass to `func`.
**kwargs
    Keyword arguments to pass to `func`.

Returns
-------
DataFrame
    A DataFrame that must have the same length as self.

Raises
------
ValueError : If the returned DataFrame has a different length than self.

See Also
--------
DataFrame.agg : Only perform aggregating type operations.
DataFrame.apply : Invoke function on a DataFrame.

Notes
-----
Functions that mutate the passed object can produce unexpected
behavior or errors and are not supported. See :ref:`gotchas.udf-mutation`
for more details.

Examples
--------
>>> df = pd.DataFrame({'A': range(3), 'B': range(1, 4)})
>>> df
   A  B
0  0  1
1  1  2
2  2  3
>>> df.transform(lambda x: x + 1)
   A  B
0  1  2
1  2  3
2  3  4

Even though the resulting DataFrame must have the same length as the
input DataFrame, it is possible to provide several input functions:

>>> s = pd.Series(range(3))
>>> s
0    0
1    1
2    2
dtype: int64
>>> s.transform([np.sqrt, np.exp])
       sqrt        exp
0  0.000000   1.000000
1  1.000000   2.718282
2  1.414214   7.389056

You can call transform on a GroupBy object:

>>> df = pd.DataFrame({
...     "Date": [
...         "2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05",
...         "2015-05-08", "2015-05-07", "2015-05-06", "2015-05-05"],
...     "Data": [5, 8, 6, 1, 50, 100, 60, 120],
... })
>>> df
         Date  Data
0  2015-05-08     5
1  2015-05-07     8
2  2015-05-06     6
3  2015-05-05     1
4  2015-05-08    50
5  2015-05-07   100
6  2015-05-06    60
7  2015-05-05   120
>>> df.groupby('Date')['Data'].transform('sum')
0     55
1    108
2     66
3    121
4     55
5    108
6     66
7    121
Name: Data, dtype: int64

>>> df = pd.DataFrame({
...     "c": [1, 1, 1, 2, 2, 2, 2],
...     "type": ["m", "n", "o", "m", "m", "n", "n"]
... })
>>> df
   c type
0  1    m
1  1    n
2  1    o
3  2    m
4  2    m
5  2    n
6  2    n
>>> df['size'] = df.groupby('c')['type'].transform(len)
>>> df
   c type size
0  1    m    3
1  1    n    3
2  1    o    3
3  2    m    4
4  2    m    4
5  2    n    4
6  2    n    4
File:      c:\users\murat\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method